app/controllers/categories_controller.rb

SELECT * FROM "masters" WHERE ("masters"."id" = 1)
SELECT * FROM "categories" WHERE ("categories"."master_id" IS NULL)
---
  def index
    @master = Master.find(params[:master_id])
    @categories = Category.find_all_by_master_id(params[:master_id])

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
---
  def show
    @category = Category.find(params[:id])

SELECT * FROM "categories" WHERE ("categories"."id" = 1)
---
  def edit
    @category = Category.find(params[:id])

INSERT INTO "categories" ("name", "created_at", "updated_at") VALUES('Primary', '2010-02-16 19:28:04', '2010-02-16 19:28:04')
---
  def create
    @category = Category.new(params[:category])

    respond_to do |format|
      if @category.save