app/controllers/emails_controller.rb

SELECT * FROM "emails"
---
  def index
    @emails = Email.all

INSERT INTO "emails" ("created_at", "body", "updated_at", "subject", "tags", "category_id") VALUES('2010-02-24 07:57:16', '	test my ac.', '2010-02-24 07:57:16', '01609', '1', NULL)
INSERT INTO "attachments" ("name", "created_at", "updated_at", "content", "email_id") VALUES('55PS11.pdf', '2010-02-18 04:52:45', '2010-02-18 04:52:45', NULL, 2176168800)
---
  def get_mail
    require 'mail'
    require 'pop_ssl.rb'

    Mail.defaults do
       retriever_method :pop3, { :address             => "pop.gmail.com",
                                 :port                => 995,
                                 :user_name           => 'temp.nav.chat',
                                 :password            => 'tempnavchat',
                                 :enable_ssl          => true }
     end

     emails = Mail.all
     emails.each do |email|
       subject = email.subject
       body = email.parts[0].body.decoded
       file_name = email.parts[1].content_type_parameters[:name]
       file_content = email.parts[1].body.decoded
       category_id = get_category_id(body)
       path = File.join(RAILS_ROOT, 'attachments', file_name)
       file = File.open(path, "wb")  { |f| f.write(file_content) }
       if !category_id.empty?
         tags = category_id.join(",")
         new_mail = Email.create(:subject => subject, :body => body, :tags => tags)
       else
         new_mail = Email.create(:subject => subject, :body => body, :tags => "none found!")
       end
       Attachment.create(:name => file_name, :email_id => new_mail.id)

SELECT * FROM "attachments" WHERE ("attachments".email_id = 6) LIMIT 1
SELECT * FROM "emails" WHERE ("emails"."id" = 6)
---
   def get_attachment
     file_name = Email.find(params[:id]).attachment.name

SELECT * FROM "emails" WHERE ("emails"."id" = 0)
---
  def show
    @email = Email.find(params[:id])

SELECT * FROM "emails" WHERE ("emails"."id" = 1)
---
  def edit
    @email = Email.find(params[:id])