app/controllers/masters_controller.rb

SELECT * FROM "masters"
---
  def index
    @masters = Master.all

SELECT * FROM "masters" WHERE ("masters"."id" = 1)
---
  def show
    @master = Master.find(params[:id])

SELECT * FROM "masters" WHERE ("masters"."id" = 1)
---
  def edit
    @master = Master.find(params[:id])

INSERT INTO "masters" ("name", "created_at", "updated_at") VALUES('Air Conditioning and Heating', '2010-02-24 03:38:25', '2010-02-24 03:38:25')
SELECT * FROM "categories" WHERE ("categories"."master_id" = 1)
SELECT * FROM "categories"
INSERT INTO "categories" ("name", "created_at", "updated_at", "master_id") VALUES('secondary', '2010-02-24 04:10:36', '2010-02-24 04:10:36', NULL)
---
  def create
    @master = Master.new(params[:master])

    respond_to do |format|
      if @master.save
        categories = Category.find_all_by_master_id(@master.id)
        if categories.empty?
          Category.create(:name => "Secondary", :master_id => @master.id)

SELECT * FROM "masters" WHERE ("masters"."id" = 1)
---
  def update
    @master = Master.find(params[:id])