app/controllers/synonyms_controller.rb

SELECT * FROM "words" WHERE ("words"."id" = 1)
SELECT * FROM "words"
---
  def index
    if params[:word_id]
      @word = Word.find(params[:word_id])
      @synonyms = @word.synonyms
    else
    @words = Word.all

INSERT INTO "synonyms" ("created_at", "updated_at", "str", "word_id") VALUES('2010-02-24 05:46:30', '2010-02-24 05:46:30', 'new', 1)
---
  def add_synonyms
    Synonym.create(:str => params[:str], :word_id => params[:word_id])

SELECT * FROM "synonyms" WHERE ("synonyms"."id" = 4)
DELETE FROM "synonyms" WHERE "id" = 4
---
  def destroy
    @synonym = Synonym.find(params[:id])
    @synonym.destroy