app/controllers/words_controller.rb

  def index
    if params[:category_id]
      @category = Category.find(params[:category_id])
      @words = @category.words
    else
    @words = Word.all
---
SELECT * FROM "categories" WHERE ("categories"."id" = 1)
SELECT * FROM "words" WHERE ("words".category_id = 1)

  def show
    @word = Word.find(params[:id])
---
SELECT * FROM "words" WHERE ("words"."id" = 1)

  def edit
    @word = Word.find(params[:id])
---
SELECT * FROM "words" WHERE ("words"."id" = 3)

  def create
    @word = Word.new(params[:word])

    respond_to do |format|
      if @word.save
---
INSERT INTO "words" ("created_at", "updated_at", "str", "category_id") VALUES('2010-02-16 19:41:31', '2010-02-16 19:41:31', 'new', 1)

  def add_words
    Word.create(:str => params[:str], :category_id => params[:category_id])
---
INSERT INTO "words" ("created_at", "updated_at", "str", "category_id") VALUES('2010-02-24 04:45:27', '2010-02-24 04:45:27', 'bb', 0)

  def update
    @word = Word.find(params[:id])

    respond_to do |format|
      if @word.update_attributes(params[:word])
---
SELECT * FROM "words" WHERE ("words"."id" = 5)
UPDATE "words" SET "updated_at" = '2010-02-16 19:47:53', "str" = 'uin' WHERE "id" = 5

  def destroy
    @word = Word.find(params[:id])
    @word.destroy
---
SELECT * FROM "words" WHERE ("words"."id" = 3)
DELETE FROM "words" WHERE "id" = 3